In [ ]:
import pandas as pd

data_dir = '/content/drive/MyDrive/infosec_ai/정형, 비정형 데이터 처리/data/주택도시보증공사_전국 평균 분양가격(2019년 12월).csv'
df_last = pd.read_csv(data_dir, encoding = 'euc-kr')

In [ ]:
df_last.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
df_last.shape

(4335, 5)

In [ ]:
%ls drive/MyDrive/infosec_ai/'정형, 비정형 데이터 처리'/data

'주택도시보증공사_전국 평균 분양가격(2019년 12월).csv'

In [ ]:
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.5+ KB

In [ ]:
df_last.isnull().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [ ]:
df_last.isna().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [ ]:
df = df_last.copy()

In [ ]:
df["분양가격"] = pd.to_numeric( df_last["분양가격(㎡)"] , errors="coerce")

In [ ]:
df["평당분양가격"] = df["분양가격"] * 3.3

In [ ]:
df

     지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0     서울                 전체  2015  10    5841  5841.0  19275.3
1     서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3
4     서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7
...   ..                ...   ...  ..     ...     ...      ...
4330  제주                 전체  2019  12    3882  3882.0  12810.6
4331  제주         전용면적 60㎡이하  2019  12     NaN     NaN      NaN
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898  3898.0  12863.4
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN     NaN      NaN
4334  제주        전용면적 102㎡초과  2019  12    3601  3601.0  11883.3

[4335 rows x 7 columns]

In [ ]:
df = df_last.copy()

In [ ]:
dictionary = {}
for item in set(df['분양가격(㎡)']):
    try:
        dictionary[item] = int(item)
    except:
        try:
            int_item = int(item.replace(',', ''))
            dictionary[f'{item}'] = int_item
        except:
            dictionary[f'{item}'] = None

In [ ]:
df['분양가격(㎡)'].replace(dictionary, inplace = True)

In [ ]:
df = df.dropna(axis= 0)

In [ ]:
df['평당분양가격'] = df['분양가격(㎡)'].astype(int) * 3.3

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4033 entries, 0 to 4334
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4033 non-null   object
 1   규모구분     4033 non-null   object
 2   연도       4033 non-null   int64
 3   월        4033 non-null   int64
 4   분양가격(㎡)  4033 non-null   float64
 5   평당분양가격   4033 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 220.6+ KB

In [ ]:
import random

In [ ]:
list_data = list(range(0, 101))

In [ ]:
random.shuffle(list_data)
print(list_data[:5])

[85, 71, 69, 79, 48]

In [ ]:
num_df = pd.DataFrame({
    "컬럼1": list_data
})

In [ ]:
num_df["컬럼1"].describe()

count    101.000000
mean      50.000000
std       29.300171
min        0.000000
25%       25.000000
50%       50.000000
75%       75.000000
max      100.000000
Name: 컬럼1, dtype: float64

In [ ]:
df.describe()

                연도            월       분양가격(㎡)        평당분양가격
count  4033.000000  4033.000000   4033.000000   4033.000000
mean   2017.315646     6.768907   3237.182246  10682.701413
std       1.232132     3.515647   1262.160474   4165.129565
min    2015.000000     1.000000   1868.000000   6164.400000
25%    2016.000000     4.000000   2440.000000   8052.000000
50%    2017.000000     7.000000   2873.000000   9480.900000
75%    2018.000000    10.000000   3561.000000  11751.300000
max    2019.000000    12.000000  12728.000000  42002.400000

In [ ]:
df.head()

  지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격
0  서울                 전체  2015  10   5841.0  19275.3
1  서울         전용면적 60㎡이하  2015  10   5652.0  18651.6
2  서울   전용면적 60㎡초과 85㎡이하  2015  10   5882.0  19410.6
3  서울  전용면적 85㎡초과 102㎡이하  2015  10   5721.0  18879.3
4  서울        전용면적 102㎡초과  2015  10   5879.0  19400.7

In [ ]:
df['분양가격(㎡)'].describe()

count     4033.000000
mean      3237.182246
std       1262.160474
min       1868.000000
25%       2440.000000
50%       2873.000000
75%       3561.000000
max      12728.000000
Name: 분양가격(㎡), dtype: float64

In [ ]:
df[df["분양가격(㎡)"] == df["분양가격(㎡)"].min() ]

    지역명               규모구분    연도   월  분양가격(㎡)  평당분양가격
138  충북  전용면적 85㎡초과 102㎡이하  2015  11   1868.0  6164.4

In [ ]:
df[df["분양가격(㎡)"] == df["분양가격(㎡)"].max()].head()

     지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격
3743  서울  전용면적 85㎡초과 102㎡이하  2019   6  12728.0  42002.4
3828  서울  전용면적 85㎡초과 102㎡이하  2019   7  12728.0  42002.4
3913  서울  전용면적 85㎡초과 102㎡이하  2019   8  12728.0  42002.4
3998  서울  전용면적 85㎡초과 102㎡이하  2019   9  12728.0  42002.4
4083  서울  전용면적 85㎡초과 102㎡이하  2019  10  12728.0  42002.4

In [ ]:
df.sort_values(by="분양가격(㎡)", ascending=False).head()

     지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격
3743  서울  전용면적 85㎡초과 102㎡이하  2019   6  12728.0  42002.4
4083  서울  전용면적 85㎡초과 102㎡이하  2019  10  12728.0  42002.4
4253  서울  전용면적 85㎡초과 102㎡이하  2019  12  12728.0  42002.4
4168  서울  전용면적 85㎡초과 102㎡이하  2019  11  12728.0  42002.4
3828  서울  전용면적 85㎡초과 102㎡이하  2019   7  12728.0  42002.4

In [ ]:
df["규모구분"].unique()

array(['전체', '전용면적 60㎡이하', '전용면적 60㎡초과 85㎡이하', '전용면적 85㎡초과 102㎡이하',
       '전용면적 102㎡초과'], dtype=object)

In [ ]:
df["전용면적"] = df["규모구분"].str.replace("전용면적", "")

In [ ]:
df.head()

  지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격           전용면적
0  서울                 전체  2015  10   5841.0  19275.3             전체
1  서울         전용면적 60㎡이하  2015  10   5652.0  18651.6          60㎡이하
2  서울   전용면적 60㎡초과 85㎡이하  2015  10   5882.0  19410.6    60㎡초과 85㎡이하
3  서울  전용면적 85㎡초과 102㎡이하  2015  10   5721.0  18879.3   85㎡초과 102㎡이하
4  서울        전용면적 102㎡초과  2015  10   5879.0  19400.7         102㎡초과

In [ ]:
df["전용면적"] = df["전용면적"].str.replace("초과","~")

In [ ]:
df["전용면적"] = df["전용면적"].str.replace("이하","")

In [ ]:
df["전용면적"] = df["전용면적"].str.replace(" ","")

In [ ]:
df.head()

  지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격      전용면적
0  서울                 전체  2015  10   5841.0  19275.3        전체
1  서울         전용면적 60㎡이하  2015  10   5652.0  18651.6       60㎡
2  서울   전용면적 60㎡초과 85㎡이하  2015  10   5882.0  19410.6   60㎡~85㎡
3  서울  전용면적 85㎡초과 102㎡이하  2015  10   5721.0  18879.3  85㎡~102㎡
4  서울        전용면적 102㎡초과  2015  10   5879.0  19400.7     102㎡~

In [ ]:
df["전용면적"] = df["전용면적"].str.strip()

In [ ]:
df.head()

  지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격      전용면적
0  서울                 전체  2015  10   5841.0  19275.3        전체
1  서울         전용면적 60㎡이하  2015  10   5652.0  18651.6       60㎡
2  서울   전용면적 60㎡초과 85㎡이하  2015  10   5882.0  19410.6   60㎡~85㎡
3  서울  전용면적 85㎡초과 102㎡이하  2015  10   5721.0  18879.3  85㎡~102㎡
4  서울        전용면적 102㎡초과  2015  10   5879.0  19400.7     102㎡~

In [ ]:
df.drop(["규모구분","분양가격(㎡)"], axis=1, inplace = True)

In [ ]:
df

     지역명    연도   월   평당분양가격      전용면적
0     서울  2015  10  19275.3        전체
1     서울  2015  10  18651.6       60㎡
2     서울  2015  10  19410.6   60㎡~85㎡
3     서울  2015  10  18879.3  85㎡~102㎡
4     서울  2015  10  19400.7     102㎡~
...   ..   ...  ..      ...       ...
4327  경남  2019  12  10114.5   60㎡~85㎡
4328  경남  2019  12  10715.1  85㎡~102㎡
4330  제주  2019  12  12810.6        전체
4332  제주  2019  12  12863.4   60㎡~85㎡
4334  제주  2019  12  11883.3     102㎡~

[4033 rows x 5 columns]

In [ ]:
score_df = pd.DataFrame({
    "학과":["컴공","보안","보안","컴공","컴공"],
    "학년":[1      , 2   ,  1    , 2    , 1],
    "영어":[90,      100,   80,    90,  70]
})

In [ ]:
df

     지역명    연도   월   평당분양가격      전용면적
0     서울  2015  10  19275.3        전체
1     서울  2015  10  18651.6       60㎡
2     서울  2015  10  19410.6   60㎡~85㎡
3     서울  2015  10  18879.3  85㎡~102㎡
4     서울  2015  10  19400.7     102㎡~
...   ..   ...  ..      ...       ...
4327  경남  2019  12  10114.5   60㎡~85㎡
4328  경남  2019  12  10715.1  85㎡~102㎡
4330  제주  2019  12  12810.6        전체
4332  제주  2019  12  12863.4   60㎡~85㎡
4334  제주  2019  12  11883.3     102㎡~

[4033 rows x 5 columns]

In [ ]:
for item in score_df.groupby(["학과"]):
  print("$" * 100)
  print("item")
  print("$" * 100)
  print(item)
  print("=" * 100)

$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
item
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
('보안',    학과  학년   영어
1  보안   2  100
2  보안   1   80)
====================================================================================================
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
item
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
('컴공',    학과  학년  영어
0  컴공   1  90
3  컴공   2  90
4  컴공   1  70)
====================================================================================================

In [ ]:
score_df.groupby('학과').mean()

          학년         영어
학과
보안  1.500000  90.000000
컴공  1.333333  83.333333

In [ ]:
score_df[['학과', '영어']].groupby('학과').mean()

           영어
학과
보안  90.000000
컴공  83.333333

In [ ]:
score_df[['학과', '영어']].groupby('학과').max()

     영어
학과
보안  100
컴공   90

In [ ]:
score_df[['학과', '영어']].groupby('학과').min()

    영어
학과
보안  80
컴공  70

In [ ]:
score_df[['학과', '영어']].groupby('학과').get_group('컴공')

   학과  영어
0  컴공  90
3  컴공  90
4  컴공  70

In [ ]:
score_df.groupby(['학과', '학년']).sum()

        영어
학과 학년
보안 1    80
   2   100
컴공 1   160
   2    90

In [ ]:
import seaborn as sns

In [ ]:
titanic = sns.load_dataset('titanic')

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
titanic_df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

In [ ]:
titanic_df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [ ]:
titanic_df.isna().sum()

age         177
sex           0
class         0
fare          0
survived      0
dtype: int64

In [ ]:
for item in titanic_df.groupby('class'):
    print('*' * 100)
    print(item)

****************************************************************************************************
('First',       age     sex  class     fare  survived
1    38.0  female  First  71.2833         1
3    35.0  female  First  53.1000         1
6    54.0    male  First  51.8625         0
11   58.0  female  First  26.5500         1
23   28.0    male  First  35.5000         1
..    ...     ...    ...      ...       ...
871  47.0  female  First  52.5542         1
872  33.0    male  First   5.0000         0
879  56.0  female  First  83.1583         1
887  19.0  female  First  30.0000         1
889  26.0    male  First  30.0000         1

[216 rows x 5 columns])
****************************************************************************************************
('Second',       age     sex   class     fare  survived
9    14.0  female  Second  30.0708         1
15   55.0  female  Second  16.0000         1
17    NaN    male  Second  13.0000         1
20   35.0    male  Second  26.0000         0
21   34.0    male  Second  13.0000         1
..    ...     ...     ...      ...       ...
866  27.0  female  Second  13.8583         1
874  28.0  female  Second  24.0000         1
880  25.0  female  Second  26.0000         1
883  28.0    male  Second  10.5000         0
886  27.0    male  Second  13.0000         0

[184 rows x 5 columns])
****************************************************************************************************
('Third',       age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns])

In [ ]:
for key, people in titanic_df.groupby('class'):
    print('*' * 100)
    print(f'key = {key}')
    print(people)

****************************************************************************************************
key = First
      age     sex  class     fare  survived
1    38.0  female  First  71.2833         1
3    35.0  female  First  53.1000         1
6    54.0    male  First  51.8625         0
11   58.0  female  First  26.5500         1
23   28.0    male  First  35.5000         1
..    ...     ...    ...      ...       ...
871  47.0  female  First  52.5542         1
872  33.0    male  First   5.0000         0
879  56.0  female  First  83.1583         1
887  19.0  female  First  30.0000         1
889  26.0    male  First  30.0000         1

[216 rows x 5 columns]
****************************************************************************************************
key = Second
      age     sex   class     fare  survived
9    14.0  female  Second  30.0708         1
15   55.0  female  Second  16.0000         1
17    NaN    male  Second  13.0000         1
20   35.0    male  Second  26.0000         0
21   34.0    male  Second  13.0000         1
..    ...     ...     ...      ...       ...
866  27.0  female  Second  13.8583         1
874  28.0  female  Second  24.0000         1
880  25.0  female  Second  26.0000         1
883  28.0    male  Second  10.5000         0
886  27.0    male  Second  13.0000         0

[184 rows x 5 columns]
****************************************************************************************************
key = Third
      age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns]

In [ ]:
titanic_df.groupby('class').mean()

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [ ]:
titanic_df.groupby('class').get_group('Third')

      age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns]